# Q1

In [53]:
import numpy as np
import pandas as pd

In [54]:
df=pd.read_csv('Cutlets.csv')
df.head()

   Unit A  Unit B
0  6.8090  6.7703
1  6.4376  7.5093
2  6.9157  6.7300
3  7.3012  6.7878
4  7.4488  7.1522

In [55]:
df.shape

(35, 2)

In [56]:
df.describe()

          Unit A     Unit B
count  35.000000  35.000000
mean    7.019091   6.964297
std     0.288408   0.343401
min     6.437600   6.038000
25%     6.831500   6.753600
50%     6.943800   6.939900
75%     7.280550   7.195000
max     7.516900   7.545900

In [57]:
unitA=df['Unit A'].tolist()
unitA

[6.809,
 6.4376,
 6.9157,
 7.3012,
 7.4488,
 7.3871,
 6.8755,
 7.0621,
 6.684,
 6.8236,
 7.393,
 7.5169,
 6.9246,
 6.9256,
 6.5797,
 6.8394,
 6.597,
 7.2705,
 7.2828,
 7.3495,
 6.9438,
 7.156,
 6.5341,
 7.2854,
 6.9952,
 6.8568,
 7.2163,
 6.6801,
 6.9431,
 7.0852,
 6.7794,
 7.2783,
 7.1561,
 7.3943,
 6.9405]

In [58]:
unitB=df['Unit B'].tolist()
unitB

[6.7703,
 7.5093,
 6.73,
 6.7878,
 7.1522,
 6.811,
 7.2212,
 6.6606,
 7.2402,
 7.0503,
 6.881,
 7.4059,
 6.7652,
 6.038,
 7.1581,
 7.024,
 6.6672,
 7.4314,
 7.307,
 6.7478,
 6.8889,
 7.422,
 6.5217,
 7.1688,
 6.7594,
 6.9399,
 7.0133,
 6.9182,
 6.3346,
 7.5459,
 7.0992,
 7.118,
 6.6965,
 6.578,
 7.3875]

In [59]:
###Null Hypothesis- There is no significant difference between diameter of cutlets of two units.

####Alternate Hypothesis- There is a difference in diameter of cutlets of two units.

In [60]:
## doing t-test

In [61]:
from scipy.stats import ttest_ind
stats,p = ttest_ind(unitA,unitB)
print('stats=%.3f,  p=%.3f' % (stats,p))
if p>0.05:
    print('Accept Null Hypothesis')
else:
    print('Accept Alternate Hypothesis')

stats=0.723,  p=0.472
Accept Null Hypothesis

In [62]:
# As p-value>0.05 so we accept the null hypothesis

# Q2

In [63]:
df=pd.read_csv('LabTAT.csv')
df.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [64]:
df.shape

(120, 4)

In [65]:
df.describe()

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

In [66]:
lab1=df['Laboratory 1'].tolist()
lab2=df['Laboratory 2'].tolist()
lab3=df['Laboratory 3'].tolist()
lab4=df['Laboratory 4'].tolist()

In [67]:
## As number of samples is more than 2, we will use ANOVA test

In [68]:
from scipy.stats import f_oneway
stats, p = f_oneway(lab1,lab2,lab3,lab4)
print('stats=%.3f, p=%.3f' % (stats,p))
if p > 0.05:
    print('Accept Null Hypothesis')
else:
    print('Accept Null hypothesis')

stats=118.704, p=0.000
Accept Null hypothesis

In [69]:
 ## As p-value is less than 0.05 we will reject null hypothesis and accept alternate hypothesis and  one or more mean TAT of  given smaples are  differt or unequal

# Q3

In [70]:
df=pd.read_csv('BuyerRatio.csv')
df.head()

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [71]:
samples=np.array([[50,142,131,70],[435,1523,1356,750]])
samples

array([[  50,  142,  131,   70],
       [ 435, 1523, 1356,  750]])

In [72]:
## chi=square test

In [73]:
from scipy.stats import chi2_contingency

stat, p, dof, expected = chi2_contingency(samples)
print('stat=%.3f, p=%.3f' % (stat, p))
if p > 0.05:
    print('Accept Null Hypothesis- No relationship ')
else:
    print('Accept Alternate Hypothesis- There is relationship')

stat=1.596, p=0.660
Accept Null Hypothesis- No relationship

In [74]:
## p-value is greater than 0.05 we will accept null hypothesis

# Q4

In [75]:
df=pd.read_csv('Costomer+OrderForm.csv')
df.head()

  Phillippines   Indonesia       Malta       India
0   Error Free  Error Free   Defective  Error Free
1   Error Free  Error Free  Error Free   Defective
2   Error Free   Defective   Defective  Error Free
3   Error Free  Error Free  Error Free  Error Free
4   Error Free  Error Free   Defective  Error Free

In [76]:
df.shape

(300, 4)

In [77]:
df['Phillippines'].value_counts()

Error Free    271
Defective      29
Name: Phillippines, dtype: int64

In [78]:
df['Indonesia'].value_counts()

Error Free    267
Defective      33
Name: Indonesia, dtype: int64

In [79]:
df['Malta'].value_counts()

Error Free    269
Defective      31
Name: Malta, dtype: int64

In [80]:
df['India'].value_counts()

Error Free    280
Defective      20
Name: India, dtype: int64

In [81]:
table=np.array([[271,261,269,280],[29,33,31,20]])
table

array([[271, 261, 269, 280],
       [ 29,  33,  31,  20]])

In [84]:
# chi square test
from scipy.stats import chi2_contingency

stat, p, dof, expected = chi2_contingency(table)
print('stat=%.3f, p=%.3f' % (stat, p))
if p > 0.05:
    print('Accept Null Hypothesis- No relationship ')
else:
    print('Accept Alternate Hypothesis- There is relationship')

stat=4.082, p=0.253
Accept Null Hypothesis- No relationship

In [83]:
  ###   As p-value> 0.05 ,the null hypothesis is accepted